test/data/cds_status/2-kings-warehouse-fin.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soap:Header>
        <oas:Security soap:role="system" soap:mustUnderstand="true">
            <oas:UsernameToken>
                <oas:Username>systemID=ALVSHMRCCDS,ou=gsi systems,o=defra</oas:Username>
                <oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</oas:Password>
            </oas:UsernameToken>
        </oas:Security>
    </soap:Header>
    <soap:Body>
        <FinalisationNotificationRequest
            xmlns="http://notifyfinalisedstatehmrcfacade.types.esb.ws.cara.defra.com">
            <ServiceHeader>
                <SourceSystem>CDS</SourceSystem>
                <DestinationSystem>ALVS</DestinationSystem>
                <CorrelationId>2128002</CorrelationId>
                <ServiceCallTimestamp>2025-11-05T09:20:00.5553237Z</ServiceCallTimestamp>
            </ServiceHeader>
            <Header>
                <EntryReference>24GBBGBKCDMA128002</EntryReference>
                <EntryVersionNumber>2</EntryVersionNumber>
                <DecisionNumber>2</DecisionNumber>
                <FinalState>5</FinalState>
                <ManualAction>N</ManualAction>
            </Header>
        </FinalisationNotificationRequest>
    </soap:Body>
</soap:Envelope>